#ifndef RKF45_H
#define RKF45_H

struct RKF45 {
    static constexpr int stages = 6;
    // a[i][j] для i=1..5, j=0..i-1 (здесь i индекс строки, j индекс столбца)
    static constexpr double a[stages][stages-1] = {
        {0,0,0,0,0},
        {1.0/4.0, 0,0,0,0},
        {3.0/32.0, 9.0/32.0, 0,0,0},
        {1932.0/2197.0, -7200.0/2197.0, 7296.0/2197.0, 0,0},
        {439.0/216.0, -8.0, 3680.0/513.0, -845.0/4104.0, 0},
        {-8.0/27.0, 2.0, -3544.0/2565.0, 1859.0/4104.0, -11.0/40.0}
    };
    static constexpr double c[stages] = {0.0, 1.0/4.0, 3.0/8.0, 12.0/13.0, 1.0, 1.0/2.0};
    static constexpr double b_low[stages] = {25.0/216.0, 0, 1408.0/2565.0, 2197.0/4104.0, -1.0/5.0, 0};
    static constexpr double b_high[stages] = {16.0/135.0, 0, 6656.0/12825.0, 28561.0/56430.0, -9.0/50.0, 2.0/55.0};
};

#endif